app/views/posts/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 12
SELECT COUNT(*) FROM "comments" WHERE "comments"."post_id" = 12
---
<ul class="comments-list">
<% if @post.comments.any? %>