app/controllers/comments_controller.rb

  def create
    @post = Post.find(params[:post_id])
    @comment = Post.find(params[:post_id]).comments.create(params[:comment])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "12"]]
INSERT INTO "comments" ("body", "commenter", "created_at", "post_id", "updated_at") VALUES (?, ?, ?, ?, ?)  [["body", "テスト"], ["commenter", "tester"], ["created_at", Sun, 14 Oct 2012 16:52:10 UTC +00:00], ["post_id", 12], ["updated_at", Sun, 14 Oct 2012 16:52:10 UTC +00:00]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 12