app/controllers/posts_controller.rb

  def index
    @posts = Post.all(:order => "created_at DESC")
---
SELECT "posts".* FROM "posts" ORDER BY created_at DESC

  def show
    @post = Post.find(params[:id])
    @comment = Post.find(params[:id]).comments.build
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "1"]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = 12

  def create
    @post = Post.new(params[:post])
    if @post.save
---
INSERT INTO "posts" ("content", "created_at", "title", "updated_at") VALUES (?, ?, ?, ?)  [["content", "テスト"], ["created_at", Sun, 14 Oct 2012 03:57:11 UTC +00:00], ["title", "tesuto"], ["updated_at", Sun, 14 Oct 2012 03:57:11 UTC +00:00]]

  def update
    @post = Post.find(params[:id])
    if @post.update_attributes(params[:post])
---
SELECT "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", "5"]]
UPDATE "posts" SET "content" = '：：：：：：：', "updated_at" = '2012-10-14 04:22:17.958724' WHERE "posts"."id" = 5